# ViewId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PreviewControl..::..ViewId Property
PreviewControl Class See Also
---
The view Id.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId ViewId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ViewId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ViewId {
	ElementId^ get ();
}
```

# See Also
PreviewControl Class
Autodesk.Revit.UI Namespace